brew "tmux"

brew "w3m"

brew "clinfo"

# Directory tree management
brew "zoxide"
brew "eza"
brew "fd"
brew "fzf"
brew "nnn"

brew "dust"
brew "gdu"
brew "duf"


# File management
brew "bat"
brew "moor"
brew "difftastic"
brew "delta"
brew "hexyl"
brew "ripgrep"
brew "ast-grep"
brew "sd"

brew "miller"
brew "dasel"
brew "fx"
brew "glow"

brew "sevenzip"

brew "imagemagick@6"
brew "mupdf-tools"
brew "ffmpeg"

# Network management
brew "xh"
brew "gping"
brew "netcat"

brew "universal-ctags"
brew "tree-sitter"
brew "neovim"

# VCS and remote repository management
brew "git"
brew "lazygit"
brew "gh"
brew "chezmoi"

# Process management
brew "procs"
brew "hyperfine"
brew "btop"
brew "nvtop"  # For GPU management.

# Scientific tools
brew "gnuplot"
brew "libqalculate"

# MIscellaneous
brew "tlrc"
brew "node"  # Needed for LSP servers.
